Autodesk.Revit.DB.Structure.AnalyticalElement.IsValidStructuralRole(Autodesk.Revit.DB.Structure.AnalyticalStructuralRole)
Checks whether the value set for Analytical Structural Role is valid for an Analytical Element.
structuralRole:
The value set to be verified.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalElement.IsValidAnalyzeAs(Autodesk.Revit.DB.Structure.AnalyzeAs)
Checks whether the value set for Analyze As is valid for an Analytical Element.
analyzeAs:
The value set to be verified.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalElement.IsSingleCurve
Indicates if the Analytical Element can be expressed as a single curve.
Returns:
True if Analytical Element can be expressed as a single curve, false otherwise.
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalElement.GetCurve
Returns the curve of the Analytical Element.
Remarks:
If the Analytical Element cannot be expressed as a single curve, an exception is thrown.
Returns:
The curve of the Analytical Element.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This AnalyticalElement contains more than one single curve.
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalElement.GetReference(Autodesk.Revit.DB.Structure.AnalyticalModelSelector)
Returns a reference to a given curve within the Analytical Element.
selector:
Specifies where in the Analytical Element the reference lies.
Returns:
Requested reference.
Throws Autodesk.Revit.Exceptions.ArgumentException:
selector is not valid for this AnalyticalElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalElement.IsValidSelector(Autodesk.Revit.DB.Structure.AnalyticalModelSelector)
Indicates if the input selector is valid for the Analytical Element.
selector:
Portion of the Analytical Element geometry.
Returns:
True if selector is valid for this Analytical Element, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalElement.GetTransform
Returns the transform which reflects Analytical Element orientation.
Returns:
The orientation of the Analytical Element.
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalElement.StructuralRole
The enum value depicting structural role asigned to the Analytical Element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The provided AnalyticalStructuralRole is not supported
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalElement.AnalyzeAs
This represents the Analyze As parameter assigned to Analytical Element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The provided AnalyzeAs is not supported
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalElement.MaterialId
Defines the Material Id for the Analytical Element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The provided MaterialId is not supported
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalElement
Base class for a structural analytical elements.
AnalyticalElement represents the analytical portion of a given Structural Element.
Since:
2023